Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: རིག་པ་དང་ཞབས་སུ་ལྡན་པ་བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི། ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: he was learned and venerable, a blissful one, a knower of the world, a steersman who guided beings, unexcelled, a teacher of gods and humans, a buddha, a blessed one.

source: དེ་སྔོན་གྱི་གཉེན་སྣག་གི་གཉེན་མཚམས་རྙིང་པ། ལྷ་སྙིང་རྗེ་ཅན་ཞིག་བར་སྣང་ལ་འདུག་སྟེ། རང་གི་གཟུགས་ཀྱི་མདོག་མི་སྣང་བར་བྱས་ནས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: At that time there was a benevolent god, who was an old friend of Jayasena, and who had before been his relative. Once, while in midair, this god made his physical appearance vanish, and then spoke these verses:

source: གྲོགས་པོ་ཡང་དག་སངས་རྒྱས་རྐང་གཉིས་མཆོག་བྱུང་བཞུགས། །
en: “ ‘My friend! The perfect Buddha, foremost of humans, has appeared.

source: འཇིག་རྟེན་རྣམས་ལ་བརྩེ་མཛད་མཚན་ནི་མཐའ་ཡས་གཟིགས། །
en: He loves all beings and his name is Infinite Vision.

source: སེམས་ཅན་ཀུན་ལ་ཕན་མཛད་ཆོས་ཀུན་ཕ་རོལ་གཤེགས། །
en: He helps all beings and has transcended everything.

source: ཞུས་པ་རྣམས་ཀྱི་མཐར་མཛད་སྟོན་པ་ཐེ་ཚོམ་སེལ། །
en: He is a teacher who puts an end to questions and removes doubts.

source: དེ་ནི་ཇི་ལྟ་བཞིན་དུ་ཀུན་མཁྱེན་དེ་དྲུང་སོང་། །བསྙེན་བྱོས་བསམས་པ་ཞུས་ཏེ་དེ་ནི་ཐོས་ནས་བསྒྲུབས། །
en: “ ‘Go before him—the Sage, who knows everything as it is— Ask what is on your mind, and put what you hear into practice.

source: སྟོན་པ་དེ་ཉིད་གསུང་བ་ངེས་ཏེ་གཞན་ཚིག་མིན། །
en: What the Teacher says is true; he has no other kind of words.

source: དེ་ཡིས་དེ་གསུང་ཇི་ལྟར་ཐོས་པ་བཞིན་དུ་སྒྲུབས། །
en: So put whatever he says into practice just as you hear it.’

source: དེ་ནས་མཚོན་མགར་རྒྱལ་སྡེ་ལྷ་དེའི་སྤོབས་པ་ཐོས་ཏེ།
en: “Jayasena the Swordsmith heard the god’s eloquent speech.

source: དེའི་མཚན་མོ་འདས་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མཐའ་ཡས་གཟིགས་དེ་ད་ལྟར་གང་ན་བཞུགས་ཞེས་ཀུན་ཏུ་ཚོལ་ལོ། །
en: After that night had passed, he began to search everywhere, asking people where the blessed thus-gone Infinite Vision was currently dwelling.

source: དེ་བཞིན་གཤེགས་པ་དེ་མཐོང་བར་བྱ་བ་མི་ཤེས་ན་གར་འགྲོ་བར་བྱ། དེ་བཞིན་གཤེགས་པ་དེ་ག་ལ་བཞུགས་ཞེས་ཤིན་ཏུ་བསྒོམ་མོ། །
en: He worked hard to find the Thus-Gone One; when it was not known where the Thus-Gone One was dwelling, he would ask where he might have traveled.

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་མཐའ་ཡས་གཟིགས་དེས་མཚོན་མགར་རྒྱལ་སྡེ་དེའི་དགེ་བའི་རྩ་བའི་དུས་ཚིགས་ལ་བབ་པར་ཐུགས་སུ་ཆུད་ནས། སྟེང་གི་བར་སྣང་ལ་དེ་བཞིན་གཤེགས་པའི་སྐུ་མངོན་པར་སྤྲུལ་ནས་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ། མཚོན་མགར་རྒྱལ་སྡེ་དེ་ལ་ཚིགས་སུ་བཅད་དེ་གསུངས་པ།
en: At that point the thus-gone Infinite Vision knew the time for Jayasena the Swordsmith’s roots of virtue was ripe, and so the Thus-Gone One manifested his form, sitting cross-legged in midair, and then spoke these verses to Jayasena the Swordsmith:

source: ཁྱོད་གང་ཚོལ་བ་འཇིག་རྟེན་མགོན་པོ་དེ་བཞིན་གཤེགས། །བཟང་པོ་དེ་ནི་ཁྱོད་ཀྱི་ཕྱིར་བཞུགས་གང་འདོད་ཞུས། །
en: “ ‘The one you look for, the sublime Thus-Gone One, Guardian of the World, is here for you, and asks what you seek.

source: ང་ནི་ཞུས་པའི་ལན་འདེབས་ང་ནི་ཐེ་ཚོམ་གཅོད།
en: I respond to questions and clear people’s doubts.

source: ཁྱོད་ཀྱི་ཡིད་ལ་གང་བསམས་མྱུར་དུ་ཞུ་བ་ཞུས། །
en: So, quickly, ask what is on your mind.’

source: ཞི་བའི་ཡིད་ཀྱིས་བཟོ་གང་རྣམ་པ་ཞུ་བ་ནི། །
en: “With a calm mind, he said,

source: འཇིག་རྟེན་གང་དུ་ཅུང་ཟད་བཟོ་ནི་བདག་མ་འཚལ། །
en: ‘I ask about a craft— Where in the world is there the slightest craft I do not know?’

source: རྒྱལ་སྡེ་སངས་རྒྱས་རབ་སྣང་ཞུ་བ་ཞུས་པ་དང་། །
en: Jayasena thus asked the radiant Buddha.

source: སྟོན་པ་ཀུན་གཟིགས་འདྲེན་པས་དེ་ཡི་ལུང་བསྟན་མཛད། །
en: Then the all-seeing guide and teacher replied:

source: གང་ལ་བཟོ་མེད་གང་ན་ནམ་ཡང་བཟོ་བོ་མེད། །ཆོས་ཀུན་མ་སྐྱེས་འདི་ནི་མི་མཆོག་བཟོ་ཡིན་ནོ། །
en: “ ‘Where there is no craft and neither any craftsman, Everything is non-arisen: this is the supreme human’s craft.

source: ང་ཡི་བཟོ་འདི་བསླབས་དང་མྱུར་དུ་བཟོ་བོར་འགྱུར། །
en: Learn my craft and you will soon become a craftsman!

source: བཟོ་རྣམས་ཀུན་ལ་བསླབས་པས་སྲོག་ཆགས་དོན་བྱེད་དོ། །
en: Learning every craft, you will then benefit sentient beings.’

source: དེ་ནས་མཚོན་མགར་རྒྱལ་སྡེས་སའི་ཕྱོགས་དེ་ཉིད་དུ་མ་གཡོས་པར་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་དེ་ཉིད་ཐོབ་བོ། །
en: “Then, without moving from that spot, Jayasena the Swordsmith achieved acceptance that phenomena are unborn.

source: མཽད་གལ་གྱི་བུ་ཁྱོད་དེའི་ཚེ་དེའི་དུས་ན་མཚོན་མགར་རྒྱལ་སྡེ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time Jayasena the Swordsmith was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་མཚོན་མགར་རྒྱལ་སྡེ་ཞེས་བྱ་བར་གྱུར་ཏོ། །བླ་ན་མེད་པའི་བཟོ་བསླབས་སོ། །
en: In those days I was Jayasena the Swordsmith, and trained in the unexcelled craft.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་ཁམས་སྣ་ཚོགས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ལ་སློབ་པར་འདོད་པས་ཆོས་ཐམས་ཅད་ཀྱི་སྐྱེ་བ་མེད་པ་ལ་བསླབ་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas who wish to train in understanding the path leading to cessation as related to knowledge of the various elements should train in the non-origination of everything.”

source: མཽད་གལ་གྱི་བུ་ངས་འཇིག་རྟེན་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བདག་འཇིག་རྟེན་ཤེས་པ་བསླབས་ནས་སེམས་ཅན་རྣམས་ལ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་ཇི་ལྟར་རབ་ཏུ་བསྟན་པར་བྱ་སྙམ་ནས
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, in order to understand the world, I decided to cultivate an understanding of the world with which I could teach beings in an accurate manner.

source: དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་དུ་མ་དག་མངོན་པར་འདུས་བྱས་ཏེ།
en: With that in mind, I created a variety of different roots of virtue.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་རྟོག་པ་ངེས་པར་དཔྱོད་པ་ཞེས་བྱ་བ་རྩ་བ་འབྱིན་པ་འཇིག་རྟེན་པ་ཐམས་ཅད་ཀྱི་རྒྱུད་མངོན་པར་ཤེས་པ་ཞིག་བྱུང་ངོ་། །
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a root digger named Truly Discerned Concept, who had extrasensory perception of all beings’ minds.

source: དེ་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ཡུལ་འཁོར་དང་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དུ་ཞུགས་ནས་རྩ་བ་ཤེས་པ་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏོ། །
en: He went from town to city to village to kingdom to palace teaching his knowledge about roots.

source: དེའི་ཚེ་ཡོངས་སུ་རྒྱུ་བ་པ་འཆར་ཀ་ཞེས་བྱ་བ་དགེ་བའི་རྩ་བ་ཀུན་ལ་བསླབས་པ་ཞིག་བྱུང་ངོ་། །
en: At that time there was also a mendicant named Udāyī who had cultivated all the roots of virtue.

source: དེས་རྟོག་པ་ལ་ངེས་པར་སེམས་པ་རྩ་བ་འབྱིན་པར་བྱེད་པ་དེ་སྐྱེ་བོའི་ཚོགས་མང་པོའི་མདུན་དུ་རྩ་བ་ཤེས་པ་རབ་ཏུ་སྟོན་ཏོ་ཞེས་ཐོས་སོ། །
en: He heard that a root digger named Truly Discerned Concept was teaching his knowledge of roots to large gatherings of people.

source: ཐོས་ནས་འདི་སྙམ་དུ་སེམས་ཏེ།
en: This made him think,

source: འཇིག་རྟེན་གྱི་ཤེས་པ་འདི་ལྟ་བུར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་མི་བྱ་སྟེ།
en: ‘One should not teach in this way about worldly knowledge, and yet

source: འདི་ལྟར་བདག་ཉིད་ཀྱིས་འཇིག་རྟེན་གྱི་ཤེས་པ་རིག་པར་བྱའོ་སྙམ་མོ། །
en: I will go and learn this sort of worldly knowledge.’

source: དེ་རྩ་བ་ཤེས་པ་ཐོས་ནས་དེ་དགོན་པར་སོང་སྟེ་བས་མཐའི་གནས་མལ་དུ་གནས་བཅས་ནས་
en: Learning the knowledge of roots, he then went to a hermitage and sat in solitude in his quarters, analyzing:

source: བདག་གིས་འཇིག་རྟེན་གྱི་ཤེས་པ་གང་ལས་བཙལ་བར་བྱ་སྙམ་དུ་དེ་ལྟར་སོ་སོར་རྟོག་གོ། །
en: ‘Where can I seek out worldly knowledge?’ The thought then came to him:

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ་འཇིག་རྟེན་གྱི་ཤེས་པ་ལུས་འདི་ཉིད་ལས་གཞན་དུ་བཙལ་བར་མི་བྱའོ་སྙམ་མོ། །
en: ‘I need not seek worldly knowledge anywhere else than this very body.’

source: འཇིག་རྟེན་འདི་དག་གང་ཡིན་ཞེས་དེ་དེ་ལྟར་སོ་སོར་རྟོག་པ་ན་འདི་ལྟར་སེམས་སྐྱེས་ཏེ།
en: ‘What is this world?’ And then the thought came to him:

source: འཇིག་རྟེན་འདི་ནི་འདི་ལྟ་སྟེ། ཕུང་པོ་ལྔ་དག་གོ། །
en: ‘This world is the five aggregates,

source: དེ་དག་ནི་སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བས་འཇིག་རབ་ཏུ་འཇིག་རྣམ་པར་རབ་ཏུ་འཇིག་ཤིག་ཤིག་པོར་འགྱུར།
en: which arise, age, become ill, and die. In that sense they are fleeting, transient, transitory, and perishable.

source: ལྷོད་ལྷོད་པོར་འགྱུར། རྙིངས་པར་འགྱུར། ཁ་དོག་ངན་པར་འགྱུར་རོ། །
en: They are unsteady, and prone to decay and decomposition.

source: ཡོངས་སུ་ཤེས་པ་གང་གིས་འཇིག་རྟེན་འདི་ཉིད་དེ་ལྟར་ཤེས་ན། རྒ་བའི་སྡུག་བསྔལ་དག་འགག་པར་འགྱུར། ན་བའི་སྡུག་བསྔལ་དག་འགག་པར་འགྱུར། འཆི་བའི་སྡུག་བསྔལ་དག་འགག་པར་འགྱུར་རོ་སྙམ་མོ། །
en: Whoever understands the world with such knowledge will bring an end to the suffering of aging, bring an end to the suffering of sickness, and bring an end to the suffering of death.’

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། སེམས་ཅན་འདི་དག་ཐམས་ཅད་ནི་འཇིག་རྟེན་གནས་པ་ཐམས་ཅད་འཇིག་པའི་ཆོས་དང་རབ་ཏུ་འཇིག་པའི་ཆོས་སུ་སེམས་ཅན་དེ་དག་གིས་རབ་ཏུ་མི་ཤེས་སོ་སྙམ་ནས། དེ་སེམས་ཅན་འདི་དག་ཉིད་ལས་སྙིང་རྗེ་ཆེན་པོ་ཐོབ་སྟེ།
en: “He then felt compassion for sentient beings, thinking, ‘None of these beings understand how the entire world consists of fleeting and transient phenomena.

source: བདག་གིས་སེམས་ཅན་འདི་དག་འཇིག་རྟེན་ལས་ཡོངས་སུ་ཐར་བར་བྱའོ་སྙམ་མོ། །
en: I will liberate all these sentient beings from the world.’

source: དེ་འདི་ཉིད་ལ་བརྩོན་པས་མངོན་པར་ཤེས་པ་ལྔ་ཐོབ་སྟེ། དེ་རང་གི་མངོན་པར་ཤེས་པ་ལྔ་པོ་དེ་དག་གིས་རྩེའོ། །
en: And setting himself to this, he achieved the five types of superknowledge, and amused himself with his five types of superknowledge.

source: མངོན་པར་ཤེས་པ་ལྔ་པོ་དག་སེམས་ཅན་རྣམས་ལ་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏོ། །
en: He then went on to teach them to others.

source: མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པས་སེམས་ཅན་དག་འགྲོ་བ་ལྔར་རྣམ་པར་རྒྱུག་པ་མཐོང་ངོ་། །
en: By means of his five types of superknowledge, he could see how sentient beings rush through the five classes of beings.

source: དེས་ན་སྙིང་རྗེ་ཆེན་པོ་བསྐྱེད་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་སེམས་ཅན་དེ་དག་ཐམས་ཅད་མངོན་པར་ཤེས་པ་ལྔ་ལ་རབ་ཏུ་བཀོད་དོ། །
en: Feeling immense compassion for them, he proceeded to lead all beings in the buddha realm to attain the five types of superknowledge.

source: མཽད་གལ་གྱི་བུ་ཁྱོད་དེའི་ཚེ་དེའི་དུས་ན་ཡོངས་སུ་རྒྱུ་བ་པ་འཆར་ཀ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time Udāyī the mendicant was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་ཡོངས་སུ་རྒྱུ་བ་པ་འཆར་ཀ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was Udāyī the mendicant.

source: ངས་གང་གིས་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དང་ལྡན་པའི་སེམས་ཅན་དེ་དག་མངོན་པར་ཤེས་པ་ལྔ་ལ་བཀོད་དོ། །
en: In that way I led all of the sentient beings throughout the buddha realm to possess the five types of superknowledge.

source: སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱི་མངོན་པར་ཤེས་པ་ལྔ་པོ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་སོ། །
en: I dedicated all those beings’ five types of superknowledge toward unsurpassed and perfect awakening.

source: སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱས་ནས་ཡོངས་སུ་མྱ་ངན་ལས་བཟླས་སོ། །
en: I also served all those beings by leading them to fully awaken to unsurpassed and perfect buddhahood, thus reaching total nirvāṇa.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་འཇིག་རྟེན་བདག་གི་ལུས་འདོམ་གང་ཙམ་པ་འདི་ཉིད་རིག་པར་བྱ།
en: Therefore, Maudgalyāyana, bodhisattvas should understand the world to be their own fathom-tall body.

source: འཇིག་རྟེན་ཀུན་འབྱུང་བ་དང་། འཇིག་རྟེན་འགོག་པ་དང་། འཇིག་རྟེན་འགོག་པར་འགྱུར་བའི་ལམ་ཡང་རིག་པར་བྱའོ། །
en: They should also understand the origin of that world, the cessation of that world, and the path that leads to the cessation of that world.

source: མཽད་གལ་གྱི་བུ་ངས་གཞན་ཡང་འཇིག་རྟེན་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་དུ་མ་དག་མངོན་པར་འདུས་བྱས་ཏེ།
en: “Furthermore, Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand the world.

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ཡང་དག་པར་ལྡན་པར་བྱས། ཚུལ་ཁྲིམས་དང་བཟོད་པ་དང་བརྩོན་འགྲུས་དང་བསམ་གཏན་དང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ཡང་དག་པར་ལྡན་པར་བྱས་སོ། །
en: I came to acquire the perfection of generosity, just as I came to possess the perfections of discipline, patience, diligence, concentration, and insight.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་ཅིང་གྲངས་མེད། བསམ་གྱིས་མི་ཁྱབ་གཞལ་དུ་མེད་གཞལ་གྱིས་མི་ལང་བརྗོད་དུ་མེད་པའི་འཁོར་བ་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དེད་དཔོན་སྙིང་རྗེ་ཅན་ཞེས་བྱ་བ་
en: Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past—a countlessly, inconceivably, immeasurably, incalculably, and inexpressibly long time ago—there was a captain named Kāruṇika.

source: མཛངས་ཤིང་གསལ་ལ་ཡིད་གཞུངས་པ། ཕྱོགས་ལ་མཁས་པ་དང་། ཕྱོགས་མཚམས་ལ་མཁས་པ་དང་། དོན་ལ་མཁས་པ་དང་། དོན་མ་ཡིན་པ་ལ་མཁས་པ་དང་། རྒྱུ་སྐར་ལ་མཁས་པ་དང་། ཉིན་མོ་ལ་མཁས་པ་དང་། ཐང་ཅིག་ལ་མཁས་པ་དང་། སྐད་ཅིག་ལ་མཁས་པ་དང་། ཡུད་ཙམ་ལ་མཁས་པ་དང་། ཐབས་ལ་མཁས་པ་དང་། ངན་སོང་ལ་མཁས་པ་ཞིག་བྱུང་ངོ་། །
en: He was clever, bright, prudent, knowledgeable about the cardinal directions and the intermediate directions, as well as about what is true and false, astrology, daytime, moments, seconds, and instants, and he was skilled in means and knowledgeable about the lower realms.

source: དེ་ངེས་པར་བྱས་པ་ཡིན་ཏེ། དགེ་མཚན་དང་བཀྲ་ཤིས་བྱས་ནས་ཚོང་པ་ལྔ་བརྒྱ་དང་ལྷན་ཅིག་ཏུ་རྒྱ་མཚོ་ཆེན་པོར་ཞུགས་སོ། །
en: Once, feeling confident, and having carried out the ceremonies for good fortune and auspiciousness, he set off to sea with five hundred merchants on board.

source: དེར་ཚོང་པའི་དེད་དཔོན་འདྲེན་པ་དེས་ཚོང་པ་དེ་དག་ལ་འཇིག་རྟེན་གྱི་གཏམ་སྨྲའོ། །
en: On the way, the captain who was acting as guide for the five hundred merchants expounded at length about the world:

source: འཇིག་རྟེན་འདིའི་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་དཔག་ཏུ་མེད་པ་ན་གཞན་ནི་སྐྱེ། གཞན་ནི་འགག །གཞན་ནི་འཇིག །གཞན་ནི་འབྱུང་།
en: ‘To the east of this world there are innumerable other worlds, some of which are being formed, some of which are ceasing, some of which are disintegrating, and some of which are emerging.

source: གཞན་ནི་ཞིག་ནས་གནས། གཞན་ནི་བྱུང་ནས་གནས། གཞན་ནི་བྱུང་སྟེ་གྲོགས་པོ་དག་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ནི་མཐའ་མེད་དོ། །
en: Still others remain in a state of post-disintegration, others remain after being formed, and others are just emerging. Friends, such worlds are innumerable .

source: དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ན་སེམས་ཅན་རིགས་ཕུན་སུམ་ཚོགས་པ་ཡོད།
en: Likewise, in all these worlds throughout the ten directions there are beings of superior type and beings of inferior type.

source: སེམས་ཅན་རིགས་དམའ་བ་ཡོད་སེམས་ཅན་ཁ་ཅིག་ནི་ཕྱུག །ཁ་ཅིག་ནི་དབུལ། སེམས་ཅན་ཁ་ཅིག་ནི་བྲན་ཡིན། ཁ་ཅིག་ནི་རྗེ་བོ་ཡིན་ཏེ།
en: Some of them are rich, some poor. Some of them are servants, some lords.

source: དེ་ལྟར་སྤྱི་ཤེས་པ་དང་། ཁྱད་པར་ཤེས་པ་རྣམ་པ་དུ་མ་འདི་ནི་འཇིག་རྟེན་ཤེས་པ་ཞེས་བྱའོ། །
en: You should understand the world in numerous ways, both in terms of general knowledge and specific knowledge.

source: གྲོགས་པོ་དག་དེ་ལྟ་བས་ན་འཇིག་རྟེན་དང་འཇིག་རྟེན་གྱི་ཤེས་པ་ལ་འབད་པར་བྱའོ། །
en: My friends, in this way, you should exert yourselves in the world and in knowledge of the world.’

source: དེའི་ཚེ་དེའི་དུས་ན་དེད་དཔོན་སྙིང་རྗེ་ཅན་ཞེས་བྱ་བ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེདེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: In case you may think that at that time the captain Kāruṇika was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་དེད་དཔོན་སྙིང་རྗེ་ཅན་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the captain Kāruṇika.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་འཇིག་རྟེན་དང་འཇིག་རྟེན་གྱི་སྤྱོད་པ་ལ་རྣལ་འབྱོར་དུ་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas should engage in the practices of the world and worldly behavior.

source: མཽད་གལ་གྱི་བུ་ངས་གཞན་ཡང་འཇིག་རྟེན་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དགེ་བའི་རྩ་བ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་ཏེ།
en: “Furthermore, Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand the world.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་སྐྱེ་བོ་ཐམས་ཅད་ཀྱི་བསམ་པའི་རྗེས་སུ་འཇུག་པ་ཞེས་བྱ་བ་
en: Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a prostitute named Adapting to All Beings.

source: གཟུགས་ཀྱིས་འཚོ་བ་གཟུགས་བཟང་ཞིང་མཛེས་ལ་བལྟ་ན་སྡུག་པ།
en: She was gorgeous and had a lovely figure.

source: ཁ་དོག་བཟང་པོ་རྒྱས་པ་མཆོག་དང་ལྡན་པ་ཞིག་བྱུང་ངོ་། །
en: She was attractive, and had a fine complexion. She was fully developed and sublime.

source: དེས་སྐྱེས་བུ་གང་དང་གང་དུ་འགྲོ་བར་འགྱུར་བ་དེ་དང་དེར་ཐམས་ཅད་ཀྱི་བསམ་པའི་རྗེས་སུ་འཇུག་སྟེ།
en: Whoever she was with, she adapted herself to their mindset.

source: བདག་གི་ངོ་བོ་ཉིད་ནི་མི་སྟོན་ཅིང་གར་ཡང་རྗེས་སུ་མི་གཏོང་ངོ་། །
en: She never revealed herself nor gave herself up.

source: མཽད་གལ་གྱི་བུ་དེ་བཞིན་དུ་འདུ་བྱེད་ཐམས་ཅད་ཇི་ལྟ་ཇི་ལྟར་སོ་སོར་བརྟགས་ན། དངོས་པོ་མེད་པར་མཐོང་སྟེ།
en: In the same way, Maudgalyāyana, if you understand how all composite things truly are, you will see that they are insubstantial.

source: འདུ་བྱེད་རྣམས་གང་ཡང་ངེས་པ་མེད་དོ། །
en: Composite things are in no way fixed.

source: གལ་ཏེ་གཙང་བར་རྟོག་ན་གཙང་བའི་ཁ་དོག་ཏུ་སྟོན་ལ།
en: If you think they are clean, they will appear to be clean.

source: གལ་ཏེ་མི་གཙང་བར་རྟོག་ན་མི་གཙང་བའི་ཁ་དོག་ཏུ་སྟོན་ཏོ། །
en: If you think they are unclean, they will appear to be unclean.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། གལ་ཏེ་བདེ་བའམ། གལ་ཏེ་སྡུག་བསྔལ་བའམ། གལ་ཏེ་རྟག་པའམ། གལ་ཏེ་མི་རྟག་པའམ། གལ་ཏེ་མཚན་མའམ། གལ་ཏེ་མཚན་མ་མེད་པར་རྟོག་ན་དེའི་ཁ་དོག་ཏུ་སྟོན་པར་བྱེད་དོ། །
en: The same can be said for perceiving things to be pleasurable or painful, permanent or impermanent, having characteristics or lacking characteristics—they will all appear in the corresponding manner.

source: མཽད་གལ་གྱི་བུ་དེ་ལ་གཙང་བར་རྟོག་པ་ནི་འཆིང་ལ། མི་གཙང་བར་རྟོག་པ་ནི་ཐར་པའོ། །
en: Maudgalyāyana, to perceive things as clean brings bondage; to recognize them as unclean brings liberation.

source: བདེ་བར་རྟོག་པ་ནི་འཆིང་ལ། སྡུག་བསྔལ་དུ་རྟོག་པ་ནི་ཐར་པའོ། །
en: To perceive things as pleasurable brings bondage; to recognize them as painful brings liberation.

source: རྟག་པ་ནི་འཆིང་ལ་མི་རྟག་པ་ནི་ཐར་པའོ། །
en: To perceive things as permanent brings bondage; to recognize them as impermanent brings liberation.

source: བདག་ནི་འཆིང་ལ་བདག་མེད་པ་ནི་ཐར་པའོ།
en: To perceive that there is a self brings bondage; to recognize selflessness brings liberation.

source: མཚན་མར་རྟོག་པ་ནི་འཆིང་ལ། མཚན་མེད་པ་རྟོག་པ་ནི་ཐར་པའོ། །
en: To perceive things as having characteristics brings bondage; to recognize them as lacking characteristics brings liberation.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འདོད་པ་དང་། སེམས་ཅན་རྣམས་ཀྱང་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བར་འདོད་པས། གཙང་བའི་མཚན་མ་སྤང་བར་བྱ་ཞིང་། མི་གཙང་བའི་མཚན་མ་ལ་བསྟེན་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattva great beings who seek complete nirvāṇa, and who wish to bring sentient beings to complete nirvāṇa, should forsake the characteristic of cleanliness and rely on the characteristic of uncleanliness.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། མཚན་མ་སྤང་བར་བྱ་ཞིང་། མཚན་མ་མེད་པ་ལ་བསྟེན་པར་བྱ་བའི་བར་དུ་སྟེ་ཐར་པའི་ལམ་ནི་དེ་ཡིན་ནོ། །
en: This can be applied to the others as well, up to forsaking characteristics and utilizing the absence of characteristics—this is the path to liberation.

source: མཽད་གལ་གྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་འཇིག་རྟེན་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ལ་ཇི་ལྟར་བསླབ་པར་བྱ་ཞེ་ན།
en: “Maudgalyāyana, you may wonder how bodhisattvas should cultivate knowledge of the origin as related to knowledge of the world.

source: མཽད་གལ་གྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་དགེ་བའི་བཤེས་གཉེན་ལ་བསྟེན་པ་བརྩོན་པ་མི་གཏང་བར་བྱའོ། །
en: Maudgalyāyana, in this regard bodhisattva great beings who wish to fully awaken to unsurpassed and perfect buddhahood should never give up relying on a spiritual guide.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། བྱང་ཆུབ་སེམས་དཔའ་འོད་ཡང་དག་འཕགས་ཞེས་བྱ་བ་
en: Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a bodhisattva named Truly Noble Radiance.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཡང་དག་པར་གནས་པ་དེ་བཞིན་གཤེགས་པ་དཔག་ཏུ་མེད་པ་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ། དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་དང་ལྡན་པ་ཞིག་བྱུང་ངོ་། །
en: He was well established in unsurpassed and perfect awakening, had formed roots of virtue with innumerable thus-gone ones, and possessed a variety of roots of virtue.

source: དེ་ཉལ་བའི་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པ་དང་ལྷན་ཅིག་གཏམ་ཡང་དག་པར་རྗོད་པ་འཇུག་པ་ལ་མ་གཏོགས་པར་གཞན་ཅི་ཡང་མི་མཐོང་སྟེ།
en: In his dreams when he was sleeping, he never experienced anything other than being engaged with the thus-gone ones in conversation;

source: ཇི་ལྟར་འདིར་དེ་བཞིན་གཤེགས་པ་དང་ལྷན་ཅིག་འདྲིས་པར་བྱས་སོ། །
en: in this way he got to know the thus-gone ones.

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་ཐོགས་མེད་སྟོན་ཅེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: At that time there had appeared in the world a thus-gone one named Unhindered Teacher.

source: དེ་བཞིན་གཤེགས་པ་ཐོགས་མེད་སྟོན་དེ་དང་ལྷན་ཅིག་བར་དུ་གཏམ་འདི་ལྟ་བུ་དག་བྱས་སོ། །
en: While he was together with the thus-gone Unhindered Teacher, they shared the following conversation.

source: བཅོམ་ལྡན་འདས་འཇིག་རྟེན་ཤེས་པ་དང་། ཀུན་འབྱུང་བ་ཤེས་པ་ཇི་ལྟར་ཡང་དག་པར་འགྲུབ་པར་འགྱུར། འཇིག་རྟེན་ཤེས་པ་དང་། ཀུན་འབྱུང་བ་ཤེས་པ་དེའི་རྒྱུ་ཉེ་བར་བགྱིད་པར་འགྱུར་བ་ནི་གང་ལགས། བཀའ་སྩལ་པ།
en: He asked, ‘Blessed One, how can one genuinely achieve understanding of the origin as related to knowledge of the world? What serves as the immediate cause of knowledge of the origin as related to knowledge of the world?’

source: རིགས་ཀྱི་བུ་ཁྱོད་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པར་ཞུགས་ཤིང་ཁྱོད་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པའི་ཕྱིར། དེ་བཞིན་གཤེགས་པ་ལ་དོན་འདི་ཡོངས་སུ་ཞུ་བར་སེམས་པ་ནི་ལེགས་སོ་ལེགས་སོ། །
en: “ ‘Noble son,” came the reply, “it is excellent that you had the thought to benefit many beings, and to ask this question of the Thus-Gone One in order to benefit many beings.

source: རིགས་ཀྱི་བུ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་བཤད་དོ། །
en: Thus, noble son, listen well and keep what I am about to say in your heart.’

source: བཅོམ་ལྡན་འདས་ལེགས་སོ་ཞེས་གསོལ་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་ཏོ། །
en: “ ‘Of course, Blessed One,’ he said, and he listened to the Blessed One attentively.

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་བསྟན་བཅོས་ཐམས་ཅད་ཤེས་པར་བྱ་བ་ལ་མངོན་པར་བརྩོན་པར་བྱ་སྟེ
en: “ ‘Noble son, bodhisattva great beings who wish to fully awaken to unexcelled and perfect buddhahood should exert themselves in learning every scripture.

source: ཤེས་པ་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་རྟོགས་པ་ལ་ཡང་བརྩོན་པར་བྱའོ། །
en: To internalize that knowledge, they should exert themselves in gaining realization.

source: འདི་ལྟ་སྟེ་བཤད་པ་དང་སྔོན་གྱི་རབས་ཀྱི་གྲུབ་པའི་མཐའ་འདི་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་གང་ཟག་གི་ཐ་སྙད་དང་། གྲོང་གི་ཐ་སྙད་ལ་བསླབ་པར་བྱ། ཡུལ་གྱི་ཐ་སྙད་ལ་བསླབ་པར་བྱ།
en: Bodhisattvas who are engaged in such explanations and the doctrines of past generations should learn the conventions of ordinary people, the conventions of a particular town, and the conventions of a particular region.

source: གང་དང་གང་དུ་འགྲོ་བ་དེ་དང་དེའི་ཐ་སྙད་ལ་བསླབ་པར་བྱ།
en: Wherever they go, they should learn the conventions of that place.

source: ཇི་ཙམ་དུ་འཇིག་རྟེན་གྱི་ཤེས་པ་གང་དག་ཤེས་པ་ཐམས་ཅད་ལ་མཁས་པར་བྱའོ། །
en: As much worldly knowledge as there is, they should master all of it.’

source: དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་འོད་ཡང་དག་འཕགས་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: In case you may think that at that time the bodhisattva called Truly Noble Radiance was anyone else, do not think so.
